{
  "backend/main.mo": "Main Motoko actor for the WoodworkbyTanishas backend, defining data types and CRUD operations for products, customization requests, contact form submissions, user profiles, and analytics, with role-based access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report listing two completed features: fixing TypeScript compilation errors in frontend paginated product calls, and correcting authenticated actor construction to properly forward non-anonymous principals to backend endpoints.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each component's or page's purpose and recent changes across the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "Minimal HTML shell for the React SPA, mounting the app into a `#root` div and loading the TypeScript entry point `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the app in ThemeProvider, InternetIdentityProvider, and QueryClientProvider, and renders a global Toaster.",
  "frontend/src/components/AdminCategoriesSection.tsx": "Admin UI section for browsing and managing products by wood-type category, with a category grid view, per-category product list, and an add-product dialog using ProductForm.",
  "frontend/src/components/AdminDashboard.tsx": "Renders the admin dashboard overview with analytics stat cards (products, messages, emails, trends) grouped by wood category, using skeleton loaders and a retry button on error.",
  "frontend/src/components/AdminProductsSection.tsx": "Admin panel section for managing products with paginated listing, add/edit dialogs via ProductForm, and delete confirmation, all backed by direct actor calls.",
  "frontend/src/components/BulkProductImport.tsx": "Provides a bulk import UI that fetches pre-configured product images as byte arrays and sequentially adds them to the backend, showing progress and per-item status.",
  "frontend/src/components/CategoryShowcase.tsx": "Displays a four-category grid (Mango Wood, Acacia Wood, Line Range, Customised Products) with images and links to the filtered collection page.",
  "frontend/src/components/FeaturedProducts.tsx": "Fetches and renders up to six featured products in a responsive grid with a loading spinner, empty state, and a link to the full collection.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating button that opens a pre-filled WhatsApp chat link, optionally referencing a specific product name.",
  "frontend/src/components/Hero.tsx": "Full-width hero banner section with a background image, gradient overlay, headline copy, and a call-to-action link to the collection page.",
  "frontend/src/components/ImageGallery.tsx": "Image gallery component that converts binary ImageId arrays to object URLs, supports prev/next navigation, and renders clickable thumbnails with a fallback image on error.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with a sticky header, responsive navigation (desktop and mobile), authentication-aware login/logout controls, social links, and a floating WhatsApp button.",
  "frontend/src/components/ProductCard.tsx": "Renders a clickable product card with an image (converted from binary ImageId), name, description, category badge, and a link to the product detail page.",
  "frontend/src/components/ProductForm.tsx": "A form component for creating or editing a product, handling image uploads with compression, field validation, and calling add/update mutations via React Query hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and identity state management via DFINITY's AuthClient, exposed through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including products, user profiles, customization requests, contact submissions, and analytics.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles with a luxury minimalist color palette using CSS custom properties for both light and dark modes, plus a fade-in animation utility.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "Renders the About Us page with a workshop hero image, company story, wood type highlights (Mango, Acacia, Custom), and a commitment section for WoodworkbyTanishas founded in 2021 in Jodhpur.",
  "frontend/src/pages/AdminPanel.tsx": "Protected admin panel page with a sidebar navigation that renders sections for Dashboard, Products, Categories, Settings, and Bulk Import; redirects unauthenticated users to the login page.",
  "frontend/src/pages/Collection.tsx": "Displays a paginated, client-side category-filtered product collection fetched from the backend actor, with load-more functionality and category filter buttons.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form that submits to the backend and opens a pre-filled WhatsApp chat; also displays location, email, and direct WhatsApp contact info.",
  "frontend/src/pages/Customize.tsx": "Custom furniture request page with a form collecting customer details and product specifications, saves the request to the backend, then opens a pre-filled WhatsApp message with the order details.",
  "frontend/src/pages/Home.tsx": "Home page that composes the Hero, CategoryShowcase, and FeaturedProducts components along with an About preview section and a CTA section linking to the Customize page.",
  "frontend/src/pages/Login.tsx": "Login page that handles Internet Identity authentication, redirects authenticated users with profiles to /admin, and shows a profile setup modal for new users who need to enter their name.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that fetches a product by ID from the URL params and displays its image gallery, description, wood type, finish info, and a WhatsApp inquiry CTA.",
  "frontend/src/utils/imageCompression.ts": "Utility that compresses an image file using the Canvas API to a max of 200KB and 1200px dimensions, progressively lowering JPEG quality until the size target is met.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with oklch-based color tokens, Inter/Playfair Display fonts, custom shadows, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata (version 43) describing the WoodworkbyTanishas furniture site architecture, existing features, known issues (actor-not-available bug when saving products), and authentication details."
}