{
  "backend/main.mo": "Main backend actor implementing product management, customization requests, contact forms, and user profiles with role-based access control (admin/user permissions) using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting that AdminPanel should display correctly after Internet Identity authentication without permission errors, referencing useQueries.ts, AdminPanel.tsx, and Login.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, and configuration, noting that AdminPanel has simplified authentication to grant access to all authenticated users and ProductForm has pre-submission admin validation.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system CSS variables for light and dark themes, including luxury minimalist palette with walnut brown, beige, and warm white tones.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'WoodworkbyTanishas', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, collection, product detail, customize, about, login, contact, admin), wrapping with InternetIdentityProvider, QueryClientProvider, ThemeProvider, and Toaster.",
  "frontend/src/components/BulkProductImport.tsx": "Component for bulk importing 30 pre-configured Mango Wood products with predefined data including IDs, names, descriptions, categories, image URLs, and finish information.",
  "frontend/src/components/CategoryShowcase.tsx": "Grid showcase displaying four wood category cards (Mango Wood, Acacia Wood, Line Range, Customised Products) with images, descriptions, and links to filtered collection page.",
  "frontend/src/components/FeaturedProducts.tsx": "Section fetching and displaying up to 6 featured products in a responsive grid using ProductCard components, with loading state and link to full collection.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed-position floating WhatsApp button that generates dynamic messages based on optional productName prop for customer inquiries.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying a full-width banner with background image, gradient overlay, heading text about wooden furniture, and a call-to-action button linking to the collection page.",
  "frontend/src/components/ImageGallery.tsx": "Image gallery component with main image display, previous/next navigation buttons, and thumbnail grid for selecting images. Handles empty state and supports keyboard navigation through product images.",
  "frontend/src/components/Layout.tsx": "Main layout component providing site-wide navigation header with logo, desktop/mobile menus, authentication state management, admin links, and footer with social media links. Includes FloatingWhatsApp component and handles logout functionality.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, and WhatsApp enquiry button. Links to product detail page and formats WhatsApp message with product information.",
  "frontend/src/components/ProductForm.tsx": "Admin form component for creating/editing products with fields for name, description, wood type, category, finish info, active status, and image uploads. Includes authentication checks, authorization validation, image upload progress tracking, and error handling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on authentication state. Initializes actor with identity for authenticated users, returns anonymous actor otherwise, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence in local storage, and authentication status states. Provides InternetIdentityProvider wrapper and useInternetIdentity hook for accessing auth context throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, roles, admin checks, products, customization requests, and contact form submissions. Includes mutations for CRUD operations and queries with caching/retry logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom luxury minimalist color palette (walnut brown, beige, warm white) for light and dark modes, plus utility animations for fade-in effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/About.tsx": "About page displaying company story, workshop image, wood types (Mango, Acacia), and commitment to sustainable craftsmanship in Jodhpur, Rajasthan.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard for authenticated users to manage products with CRUD operations, category filtering, bulk import, and authentication/authorization checks.",
  "frontend/src/pages/Collection.tsx": "Product collection page with category filters (All, Mango Wood, Acacia Wood, Line Range, Customised) and grid display of products using ProductCard components.",
  "frontend/src/pages/Contact.tsx": "Contact page with form submission (name, email, message), contact information display (location, email, WhatsApp), and success state handling.",
  "frontend/src/pages/Customize.tsx": "Customization form page that collects customer details, product specifications, and optional reference images, then opens WhatsApp with a pre-filled message containing the customization request.",
  "frontend/src/pages/Home.tsx": "Main landing page that displays Hero, CategoryShowcase, FeaturedProducts components, along with an About preview section and a CTA section linking to the customization page.",
  "frontend/src/pages/Login.tsx": "Admin login page using Internet Identity authentication with a profile setup modal for first-time users, redirecting to the admin panel after successful authentication.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page that displays a single product with image gallery, description, finish info, and a WhatsApp enquiry button using product data fetched by ID.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Inter and Playfair Display), shadows, animations, and plugins for typography and container queries.",
  "project_state.json": "Project state tracking file for WoodworkbyTanishas furniture website, documenting architectural decisions, known admin panel authentication issues, and completed features including home page, collection filtering, product details, and WhatsApp inquiry integration. Currently at version 15 with active fix request for admin privileges not being granted despite successful authentication."
}