{
  "backend/main.mo": "Main backend actor implementing product management, user profiles, customization requests, and contact forms with role-based access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: admin authentication flow fix and WhatsApp integration for customization requests.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components, pages, hooks, and configuration files describing their functionality and relationships.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system variables for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with 8 routes (Home, Collection, ProductDetail, Customize, About, Login, Contact, AdminPanel) wrapped in Layout component.",
  "frontend/src/components/BulkProductImport.tsx": "Component for bulk importing 30 pre-configured Mango Wood products with images, descriptions, and metadata using the addProduct mutation with progress tracking.",
  "frontend/src/components/CategoryShowcase.tsx": "Grid showcase displaying four wood category cards (Mango Wood, Acacia Wood, Line Range, Customised Products) with images and links to filtered collection page.",
  "frontend/src/components/FeaturedProducts.tsx": "Section component fetching and displaying up to 6 featured products in a responsive grid with loading state and link to full collection.",
  "frontend/src/components/FloatingWhatsApp.tsx": "A floating WhatsApp button component that appears in the bottom-right corner, allowing users to initiate a WhatsApp conversation with pre-filled messages about products or general inquiries.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying a full-width banner with background image, gradient overlay, headline text about wooden furniture, and a call-to-action button linking to the collection page.",
  "frontend/src/components/ImageGallery.tsx": "Image gallery component with main image display, previous/next navigation buttons, and thumbnail grid for viewing multiple product images with selection state.",
  "frontend/src/components/Layout.tsx": "Main layout component providing site-wide navigation header with logo, menu links, authentication controls, mobile menu, footer with social links, and FloatingWhatsApp integration.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, description, and a WhatsApp enquiry button, with hover effects and link to detailed product page.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating/editing products with fields for name, category, wood type, description, finish info, active status, and image upload with progress tracking.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, handling both authenticated and anonymous actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for managing Internet Identity authentication, providing login/logout functionality, identity state management, and authentication status tracking with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, roles, products (public and admin), customization requests, and contact form submissions. Handles query caching, mutations, and invalidation logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom luxury minimalist color palette (walnut brown, beige, warm white) for light and dark modes, plus utility animations like fade-in.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/About.tsx": "About page displaying company story, workshop image, wood types (Mango, Acacia), and commitment to sustainability and craftsmanship since 2021 in Jodhpur, Rajasthan.",
  "frontend/src/pages/AdminPanel.tsx": "Admin dashboard for managing products with authentication checks, role verification, and CRUD operations including add, edit, delete, and bulk import functionality.",
  "frontend/src/pages/Collection.tsx": "Product collection page with category filters (All, Mango Wood, Acacia Wood, Line Range, Customised Products) and grid display of products using ProductCard components.",
  "frontend/src/pages/Contact.tsx": "Contact page with form submission (name, email, message), contact information display (location, email, WhatsApp), and success notification handling.",
  "frontend/src/pages/Customize.tsx": "Customization form page that collects customer details, product specifications, and optional reference images, then opens WhatsApp with a pre-filled message containing the customization request.",
  "frontend/src/pages/Home.tsx": "Main landing page that displays Hero, CategoryShowcase, FeaturedProducts components, plus an About preview section and a CTA section linking to the customization page.",
  "frontend/src/pages/Login.tsx": "Admin login page using Internet Identity authentication with profile setup dialog; redirects authenticated admins to the admin panel after successful login and profile completion.",
  "frontend/src/pages/ProductDetail.tsx": "Product detail page displaying image gallery, product information (name, description, wood type, category, finish), and a WhatsApp enquiry button with floating WhatsApp component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended typography, container queries, animations, and custom design tokens for a furniture e-commerce theme.",
  "project_state.json": "Project state tracking file for WoodworkbyTanishas furniture website, documenting architectural decisions, features, and requirements. Includes luxury minimalist design specifications, WhatsApp inquiry integration, admin panel with Internet Identity authentication, and product catalog with wood category filtering."
}